app/controllers/resources_controller.rb

SELECT "resources".* FROM "resources"
---
  def index
    @resources = Resource.all

INSERT INTO "resources" ("user_id", "link", "description", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 38], ["link", "sfsdf"], ["description", "sdfdsf"], ["created_at", "2020-04-24 19:12:39.251851"], ["updated_at", "2020-04-24 19:12:39.251851"], ["name", "sdfdsf"]]
---
  def create
    @resource = Resource.new(resource_params)

    if @resource.save

UPDATE "resources" SET "link" = $1, "name" = $2, "updated_at" = $3 WHERE "resources"."id" = $4  [["link", "77777777"], ["name", "77777777"], ["updated_at", "2020-05-07 18:02:25.534999"], ["id", 41]]
---
  def update
    if @resource.update(resource_params)

DELETE FROM "resources" WHERE "resources"."id" = $1  [["id", 35]]
---
  def destroy
    @resource.destroy

SELECT "resources".* FROM "resources" WHERE "resources"."user_id" = $1  [["user_id", 1]]
---
  def users_resources
    @resources = Resource.where(user_id:params[:user_id])

SELECT "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
---
    def set_resource
      @resource = Resource.find(params[:id])